<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<TITLE>Türarten</TITLE>
<style fprolloverstyle>A:hover {color: #00FFFF; font-style: italic}
</style>
</HEAD>
<BODY LINK="#0000ff" background="../hinten.jpg">

<B><I><FONT SIZE=6>

<p align="center" style="word-spacing: 0; margin-top: 0; margin-bottom: 0"><font face="Arial" color="#008080" size="5">&gt;&gt;
Mapping Academy - Tutorials &lt;&lt;</font></p>

<p align="left" style="word-spacing: 0; margin-top: 0; margin-bottom: 0">&nbsp;</p>

<p align="center" style="word-spacing: 0; margin-top: 0; margin-bottom: 0"><font face="Arial" size="3" color="#808080">(c)
2003</font><font face="Arial" size="3" color="#C0C0C0">  <a href="http://www.darth-arth.de" target="_blank">www.darth-arth.de</a></font></p>

<hr>

</FONT>
</I>
</B><I><U><P ALIGN="left"><font color="#FFFFFF" size="6" face="Arial">Tutorial:</font></P>
<FONT SIZE=5><P ALIGN="left"><font face="Arial" color="#FFFFFF">Verschiedene T&uuml;rarten
by Guard (Christophe B.)</font></P>
</FONT></U>
</I>
<FONT SIZE=5>
<P ALIGN="left"><font face="Arial" color="#C0C0C0">Vorraussetzungen:</font></P>
</FONT><P ALIGN="JUSTIFY"><font face="Arial" size="3" color="#C0C0C0">Grundwissen (R&auml;ume erstellen)</font></P>
<P ALIGN="JUSTIFY"><font face="Arial" size="3" color="#C0C0C0">Basiswissen der `func_****`
(T&uuml;ren erstellen)</font></P>
<hr>
<P ALIGN="left"><FONT SIZE=5><font face="Arial" color="#C0C0C0">Einf&uuml;hrung</font></P>
</FONT><P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">In diesem Tutorial werden verschiedene M&ouml;glichkeiten vorgestellt, eine T&uuml;r zu &ouml;ffnen. Da in den verschiedenen JK2-Editingforn immer wieder solche Fragen auftachen, sollte diese Tutorial manchen Leuten weiterhelfen.</font> </P>
<P ALIGN="LEFT"></P>
<FONT SIZE=5><P ALIGN="left"><font face="Arial" color="#C0C0C0">Hintergrundwissen</font></P>
</FONT><P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Um die T&uuml;ren richtig in den Spielfluss der Map einzubetten, muss man verschiedene Grunds&auml;tze beachten: Den Stil der Map, die Bauweise und die Geschwindigkeit.</font></P>
<P ALIGN="LEFT"></P>
<U><P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Den Stil der Map</font></U><font face="Arial" size="2" color="#C0C0C0">: Texturen tragen neben der Beleuchtung wesentlich zur Gesamtatmosph&auml;re einer Map bei. Imperiale Doppelt&uuml;ren passen halt nicht in einen alten, verfallenen Tempel. Dagegen w&uuml;rden Steint&uuml;ren in einer Imperialen Basis wohl sehr l&auml;cherlich aussehen und die Atmosph&auml;re zerst&ouml;ren. Deshalb auf die Umgebung achten, in der sich die T&uuml;r befinden soll.</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Auch die &Ouml;ffnungsm&ouml;glichen sollten bedacht werden. Automatische T&uuml;ren sind meistens in imperialen Basen anzutreffen, aber auch an anderen Stellen, an denen sich viele Leute aufhalten. Manuelle T&uuml;ren findet man in Lagerr&auml;umen, Gef&auml;ngnissen usw...</font></P>
<P ALIGN="LEFT"></P>
<U><P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Die Bauweise</font></U><font face="Arial" size="2" color="#C0C0C0">: Neben den Texturen ist die Bauweise der T&uuml;r selbst mitentscheidend. Die Bauweise sollte immer dem Stil der Map angepasst sein. Imperiale T&uuml;ren sind meistens gut gepanzert, und bestehen aus maximal 2 H&auml;lften. In manchen urbanen Empfangsr&auml;umen k&ouml;nnen T&uuml;ren vorkommen, die ein Sehr hohes Detail-level besitzen (Eingelegtes Glas, Verzierungen, Gitter) und aus mehreren beweglichen Teile bestehen.  In Tempelanlagen (wie das Lichtschwertraining im Singelplayer) sind meistens Schwere Steint&uuml;ren zu finden.</font></P>
<P ALIGN="LEFT"></P>
<U><P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Die Gescwindigkeit</font></U><font face="Arial" size="2" color="#C0C0C0">: Auch die Spielgeschwindigkeit tr&auml;gt einiges zum Design der T&uuml;ren bei. Ein Saberonly-Match spielt sich langsamer als ein Waffengame, welches sich wieder von CTF/CTY unterscheidet. Schwere, langsame T&uuml;ren in einer CTF-Map behindern den Spieler und sorgen unter Umst&auml;nden f&uuml;r Ver&auml;rgerung. Andererseits k&ouml;nnen solche T&uuml;ren, wenn sie wohlplaziert sind, einiges an Taktik in das Spiel bringen. F&uuml;r Weaponmatches sind schnelle T&uuml;ren ein wichtiges Element, da sie nur zur visuellen Abdeckung dienen, und nicht zum Abschlie&szlig;en eines Areals.</font></P>
<FONT SIZE=5>
<hr>
<P ALIGN="left"><font face="Arial" color="#C0C0C0">T&uuml;rarten</font></P>
</FONT><P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Es gibt mehrere M&ouml;glichkeitein, T&uuml;ren zu &ouml;ffnen. Automatisch, per Knopfdruck oder mit dem Use-Button. Dazu gibt es noch einige Besonderheiten, wie Kraftfelder usw.... Die Eignung der verschiedenen Arten wurde schon oben beschrieben. Im folgenden Kapitel sehen wir uns das Erstellen n&auml;her an.</font></P>
<P ALIGN="LEFT"><font face="Arial" size="4" color="#C0C0C0">1. A</font><font face="Arial" size="4" color="#C0C0C0">utomatische T&uuml;ren</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Automatische T&uuml;ren sind nichts anderes als func_door, wie sie in <A HREF="mapping/tworooms/tworooms.htm">Dart Arth’s Tutorial</A> beschrieben werden. Sie &ouml;ffnen sich automatisch, sobald der Spieler in die N&auml;he kommt.</font></P>
<P ALIGN="left"><font face="Arial" size="4" color="#C0C0C0">2. T&uuml;ren mit Schalter</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Diese Art von T&uuml;r wird &uuml;ber einen Schalter (func_button) ge&ouml;ffnet. Ingame muss der Spieler gegen einen solchen func_button laufen, um die T&uuml;r zu &ouml;ffnen. Der func_button kann in beliebiger Entfernung angebracht werden.</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Wenden wir uns dem eigentlichen Aufbau zu. Als erstes brauchen wir eine einfache T&uuml;r, wie sei bei Punkt 1 beschrieben wird. Dann ben&ouml;tigen wir den Schalter. Dazu erstellen wir einen Brush, belegen ihn mit einer Schaltertextur (z.B.
cairn/door_display) und machen ihn per Entity-Men&uuml; (N) zu einem func_button.</font></P>
<P ALIGN="LEFT"><font face="Arial" color="#C0C0C0"><IMG SRC="doors/Image1.gif" WIDTH=301 HEIGHT=480></font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Dort stellen wir auch ein, in welche Richtung sich der Button bewegen soll, wenn ein Spieler dagegen l&auml;uft. Mit den Angle-Buttons wird die Richtung festgelegt. (Die Richtung bezieht sich auf die 2D-Draufsicht). Dann noch den func_button mit der T&uuml;r verkn&uuml;pfen (STRG + K) und fertig.</font></P>
<P ALIGN="LEFT"></P>
<B><P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">TIPP:</font></B> <font face="Arial" size="2" color="#C0C0C0"> Da es etwas seltsam aussieht, wenn sich der Schalter bewegt, kann man einen kleinen Trick anweden. Man erstellt einen normalen Brush, der die Schaltertextur besitzt, und darunter einen kleineren, flachen Brush, der dann die func_button-Funktion &uuml;bernimmt. Diesen kleineren Brush belegt man dann mit einer unsichtbaren Textur (System/Caulk oder System/Nodraw).</font></P>
<P ALIGN="LEFT"><font face="Arial" color="#C0C0C0"><IMG SRC="doors/Image2.gif" WIDTH=600 HEIGHT=242></font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Im Spiel l&auml;uft der Spieler dann gegen den unsichtbaren Brush. Dieser bewegt sich, aber weil der unsichtbar ist, sieht man das nicht und meint, man w&uuml;rde gegen den Brush mit der Schaltertextur laufen.</font></P>
<P ALIGN="left"><font face="Arial" size="4" color="#C0C0C0">3. T&uuml;ren mit „Benutzen&quot;</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Eine weitere T&uuml;rart sind T&uuml;ren, die sich &ouml;ffnen, sobald man in einem bestimmten Bereich die Benutzen-Taste dr&uuml;ckt. Um diese Art T&uuml;r zu erstellen ben&ouml;tigen wir eine func_door (wie in Kapitel 1 beschrieben), einen trigger_multiple, und einen Brush mit Schaltertextur(oder etwas &auml;hnliches um den Bereich, in dem man die Benutzen-Taste dr&uuml;cken soll, kennzeichnet).</font></P>
<P ALIGN="LEFT"><font face="Arial" color="#C0C0C0"><IMG SRC="doors/Image3.gif" WIDTH=602 HEIGHT=206></font></P>
<P ALIGN="LEFT"><font face="Arial" color="#C0C0C0">A<font size="2">ls erstes konstruieren wir die func_door, und stellt Angle, Geschwindigkeit usw. ein. Danach sollte ein Blickfang, wie Schalter, Markierung oder &auml;hnliches, erstellt werden, damit der Spieler sp&auml;ter wei&szlig;, wo er die Benutzen-Taste dr&uuml;cken soll. In diesem Bereich erstellen wir nun einen Brush und geben ihm die triggertextur (system/trigger). Dann &ouml;ffnen wir das Entity-Men&uuml;, und w&auml;hlen aus der oberen Liste trigger_multiple aus. Im Men&uuml; aktivieren wir die Checkbox Use_Button, damit sich die T&uuml;r erst &ouml;ffnet, wenn der Spieler sich im trigger_multiple befindet und die Benutzen-Taste dr&uuml;ckt.</font></font></P>
<P ALIGN="LEFT"></P>
<P ALIGN="left"><font face="Arial" size="4" color="#C0C0C0">Besonderheit: Kraftfelder</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Eine Besonderheit sind Kraftfelder. Diese blau leuchtenden Barrieren werde dort eingesetzt, wo normale T&uuml;ren nicht ausreichen w&uuml;rden, wie z.B Gef&auml;ngniszellen, besonders gesicherte Zug&auml;nge usw. Typisch f&uuml;r Kraftfeldersind ausserdem die ovalen Durchg&auml;nge, die innen durch die wei&szlig; leuchtenden Projektoren erhellt werden. In Jedi Knight 2 werden Kraftfelder wie T&uuml;ren eingesetzt und versperren dem Spieler bestimmte Wege. Aber im unterschied zu normalen T&uuml;ren kann man durch Kraftfelder hindurchsehen, was in bestimmten Situationen sehr n&uuml;tzlich ist. Kraftfelder werden wie folgt aufgebaut.</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Als erstes ben&ouml;tigen wir einen geeigneten „Rahmen&quot; f&uuml;r das Kraftfeld, um die Glaubw&uuml;rdigkeit zu steigern.</font></P>
<P ALIGN="LEFT"><font face="Arial" color="#C0C0C0"><IMG SRC="doors/Image4.gif" width="499" height="311"></font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Der in diesem Bild verwendete Rahmen besteht aus einfachen Brushes und vier &quot;Endcaps&quot;, die innen mit einer Textur belegt sind, die die Kraftfeld-Projektoren darstellen soll.</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Als n&auml;chstes ben&ouml;tigen wir das Kraftfeld selbst. Dazu erstellen wir einen Brush, der die dem Rahmen entsprechende Gr&ouml;&szlig;e besitzt und geben ihm eine Kraftfeld-Textur (z.B doomgiver/forcefield). Diesen Brush definieren wir per Entity-Men&uuml; als func_useable.</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Im Men&uuml; kann man w&auml;hlen, on das Kraftfeld beim Spielstart aktiviert ist und auf Knopfdruck ausgeschaltet wird, oder umgekehrt. (start_off).</font></P>
<P ALIGN="LEFT"><font face="Arial" color="#C0C0C0"><IMG SRC="doors/Image5.gif" width="219" height="414"></font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">Um das Kraftfeld realistischer zu gestalten, empfiehlt es sich, target_speaker mit Kraftfeld-Ger&auml;usch (zu finden in sound/movers/doors) einsetzt.</font></P>
<P ALIGN="LEFT"><font face="Arial" size="2" color="#C0C0C0">So, das wars dann schon. F&uuml;r weitere Fragen:</font></P>
<P ALIGN="LEFT"><A HREF="http://www.darth-arth.de/"><font face="Arial" size="2">Darth Arth's Mapping Academy</font></A></P>
<P ALIGN="LEFT"><A HREF="http://www.jedi-knight2.de/"><font face="Arial" size="2">Jedi-Knight2.de</font></A></P>
<P ALIGN="LEFT"><A HREF="http://www.fieslingsplace.de/"><font face="Arial" size="2">Fiesling's Place</font></A></P>
<hr>
<p style="word-spacing: 0; margin-top: 0; margin-bottom: 0"><u><a href="downloads/BSPMap_Tueren.zip"><font face="Arial" size="2" color="#FFFF00">DOWNLOAD
DER TUTORIAL MAP</font></a></u></p>
<p style="word-spacing: 0; margin-top: 0; margin-bottom: 0"><font face="Arial" color="#C0C0C0" size="1">(
.map - Datei enthalten)</font></p>
<P 
style="MARGIN: 0px; WORD-SPACING: 0px; TEXT-INDENT: 0px; LINE-HEIGHT: 100%">&nbsp;</P>
<hr>
<div align="center">
  <font class="box" face="Verdana, Arial, Helvetica, sans-serif" size="1" color="#008080">Alle
  Bilder, Texte, Grafiken, wenn nicht anders gekennzeichnet: </font>
</div>
<div align="center">
  <font class="box" face="Verdana, Arial, Helvetica, sans-serif" size="1" color="#008080">©
  2000 - 2003 (Artur L.) <a href="http://www.darth-arth.de" target="_blank">www.darth-arth.de</a></font>
</div>
<div align="center">
  <font class="box" face="Verdana, Arial, Helvetica, sans-serif" size="1" color="#008080">Nur
  zur privaten Nutzung. Kopieren nicht gestattet. Darth-Arth.de ist ausdrücklich
  nicht für den Inhalt externer Seiten verantwortlich. Es gelten die
  angegebenen Nutzungsbedingungen.</font>
</div>
</BODY>
</HTML>
